# Homebrew Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# Programming Languages and Tools
brew "python@3.12"                    # Interpreted, interactive, object-oriented programming language (specific version)
#brew "go"                             # Open source programming language to build simple/reliable/efficient software
brew "lua"                            # Powerful, lightweight programming language
brew "luajit"                         # Just-In-Time Compiler (JIT) for the Lua programming language
#brew "gradle"                         # Open-source build automation tool based on the Groovy and Kotlin DSL
#brew "openjdk@17"                     # Development kit for the Java programming language
brew "pipenv"                         # Python dependency management tool
brew "pyenv"                          # Python version management
brew "virtualenv", link: false        # Tool for creating isolated virtual python environments

# Editors and Development Tools
brew "neovim"                         # Ambitious Vim-fork focused on extensibility and agility
brew "code-minimap"                   # High performance code minimap generator
brew "stow"                           # Organize software neatly under a single directory tree (e.g. /usr/local)

# Version Control and Development Utilities
brew "git"                            # Distributed revision control system
brew "git-quick-stats"                # Simple and efficient way to access statistics in git
brew "gh"                             # GitHub command-line tool

# Shells and Terminal Utilities
brew "fish"                           # User-friendly command-line shell for UNIX-like operating systems
brew "zsh"                            # UNIX shell (command interpreter)
brew "zsh-completions"                # Additional completion definitions for zsh
brew "glances"                        # Alternative to top/htop
brew "picocom"                        # Minimal dumb-terminal emulation program

# Terminal Utils
brew "eza"                            # Modern, maintained replacement for ls
brew "bat"                            # Cat but with wings
brew "fd"                             # Simple, fast and user-friendly alternative to find
brew "fzf"
brew "tree"                           # Display directories as trees (with optional color/HTML output)
brew "wget"                           # Internet file retriever
brew "ripgrep"                        # Search tool like grep and The Silver Searcher - required for nvim
brew "jq"                             # Lightweight and flexible command-line JSON processor
brew "stow"                           # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "cheat"

# System Utilities
brew "coreutils"                      # GNU File, Shell, and Text utilities
brew "findutils"                      # Collection of GNU find, xargs, and locate
brew "graphviz"                       # Graph visualization software from AT&T and Bell Labs

# DevOps
brew "docker"                         # Pack, ship and run any application as a lightweight container
brew "docker-compose"                 # Isolated development environments using Docker
brew "kubeseal"                       # Kubernetes controller and tool for one-way encrypted Secrets
brew "minikube"                       # Run a Kubernetes cluster locally

# Compression and File Formats
brew "zstd"                           # Zstandard is a real-time compression algorithm
brew "libtiff"                        # TIFF library and utilities
brew "little-cms2"                    # Color management engine supporting ICC profiles

# Fonts and GUI Applications (Casks)
cask "amethyst"                       # Automatic tiling window manager similar to xmonad
cask "devtoys"                        # Utilities designed to make common development tasks easier
cask "font-hack-nerd-font"            # Nerd Font: Hack
cask "mactex"                         # Full TeX Live distribution with GUI applications
cask "warp"                           # Rust-based terminal
cask "kitty"

# Hashicorp
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"        # Terraform
brew "tfsec"                          # Static analysis security scanner for your terraform code
